{
  "architectures": [
    "TinyLlavaForConditionalGeneration"
  ],
  "cache_dir": null,
  "connector_type": "mlp2x_gelu",
  "hidden_size": 1536,
  "ignore_index": -100,
  "image_aspect_ratio": "square",
  "image_token_index": -200,
  "llm_model_name_or_path": "apple/OpenELM-450M-Instruct",
  "model_type": "tinyllava",
  "auto_map": {
    "AutoConfig": "configuration.TinyLlavaConfig",
    "AutoModelForCausalLM": "modeling_tinyllava_elm.TinyLlavaForConditionalGeneration"
  },
  "num_queries": 128,
  "num_resampler_layers": 3,
  "pad_token": "<unk>",
  "pad_token_id": 0,
  "resampler_hidden_size": 768,
  "text_config": {
    "_name_or_path": "apple/OpenELM-450M-Instruct",
    "activation_fn_name": "swish",
    "architectures": [
      "OpenELMForCausalLM"
    ],
    "auto_map": {
      "AutoConfig": "apple/OpenELM-450M-Instruct--configuration_openelm.OpenELMConfig",
      "AutoModelForCausalLM": "apple/OpenELM-450M-Instruct--modeling_openelm.OpenELMForCausalLM"
    },
    "ffn_dim_divisor": 256,
    "ffn_multipliers": [
      0.5,
      0.68,
      0.87,
      1.05,
      1.24,
      1.42,
      1.61,
      1.79,
      1.97,
      2.16,
      2.34,
      2.53,
      2.71,
      2.89,
      3.08,
      3.26,
      3.45,
      3.63,
      3.82,
      4.0
    ],
    "ffn_with_glu": true,
    "head_dim": 64,
    "max_context_length": 2048,
    "model_dim": 1536,
    "model_type": "openelm",
    "normalization_layer_name": "rms_norm",
    "normalize_qk_projections": true,
    "num_gqa_groups": 4,
    "num_kv_heads": [
      3,
      3,
      3,
      4,
      4,
      4,
      4,
      4,
      4,
      4,
      5,
      5,
      5,
      5,
      5,
      5,
      6,
      6,
      6,
      6
    ],
    "num_query_heads": [
      12,
      12,
      12,
      16,
      16,
      16,
      16,
      16,
      16,
      16,
      20,
      20,
      20,
      20,
      20,
      20,
      24,
      24,
      24,
      24
    ],
    "num_transformer_layers": 20,
    "qkv_multipliers": [
      0.5,
      1.0
    ],
    "rope_freq_constant": 10000,
    "rope_max_length": 4096,
    "share_input_output_layers": true,
    "tie_word_embeddings": true,
    "torch_dtype": "float16"
  },
  "tokenizer_model_max_length": 2048,
  "tokenizer_name_or_path": "meta-llama/Llama-2-7b-hf",
  "tokenizer_padding_side": "right",
  "tokenizer_use_fast": false,
  "torch_dtype": "float16",
  "transformers_version": "4.39.3",
  "tune_type_connector": "full",
  "tune_type_llm": "full",
  "tune_type_vision_tower": "frozen",
  "tune_vision_tower_from_layer": 0,
  "use_cache": true,
  "vision_config": {
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "image_size": 384,
    "intermediate_size": 4304,
    "layer_norm_eps": 1e-06,
    "model_name_or_path": "google/siglip-so400m-patch14-384",
    "model_name_or_path2": "",
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 27,
    "patch_size": 14
  },
  "vision_feature_layer": -2,
  "vision_feature_select_strategy": "patch",
  "vision_hidden_size": 1152,
  "vision_model_name_or_path": "google/siglip-so400m-patch14-384",
  "vision_model_name_or_path2": "",
  "vocab_size": 32000
}
